# MeshFromGeometryOperationResult Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MeshFromGeometryOperationResult Methods
MeshFromGeometryOperationResult Class See Also
---
The MeshFromGeometryOperationResult type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetIssues | Returns the array of issues encountered while building a mesh. |
| GetMesh | This returns a valid mesh only for the first call. Later calls will throw an exception as the mesh is no longer valid in this object. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace